10/data/attachments/2e324370b1427efa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_easy_Friend_8703_3</nif:username>
            <nif:friendToBeRequested>soap_friends_e640d8d4-cc95-4499-a45e-95bdf4047d43</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>